Revit 2027 API
SymbolTypeId.Shekel Property
 Symbol ₪, indicating unit Currency.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Shekel { get; }
Public Shared ReadOnly Property Shekel As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Shekel {
	ForgeTypeId^ get ();
}
static member Shekel : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SymbolTypeId Class
Autodesk.Revit.DB Namespace